---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.ElementHasOpenConnection
source: html/a91f20a3-f54e-4f8b-9bc5-b3a54db81f32.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.ElementHasOpenConnection Property

This element has an open connection. This may not be an error, but all open connections should be sealed with an end cap.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementHasOpenConnection { get; }
```